---
type: PointCloudOverrides
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 10
tags: [revit-api, class]
---

# PointCloudOverrides

`Autodesk.Revit.DB.PointClouds.PointCloudOverrides` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PointCloudOverrides | 2014 | `public PointCloudOverrides ()` |
| Method | ArePointCloudOverrideSettingsValid | 2014 | `public static bool ArePointCloudOverrideSettingsValid ( string tag , PointCloudOverrideSettings settings )` |
| Method | Assign | 2014 | `public void Assign ( PointCloudOverrides other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetPointCloudRegionOverrideSettings | — | `` |
| Method | GetPointCloudScanOverrideSettings | — | `` |
| Method | IsEqual | 2014 | `public bool IsEqual ( PointCloudOverrides other )` |
| Method | SetPointCloudRegionOverrideSettings | — | `` |
| Method | SetPointCloudScanOverrideSettings | — | `` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |